Revit 2027 API
Document.NewGutter(GutterType, ReferenceArray) Method
Creates a gutter along a reference array.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Gutter NewGutter(
	GutterType GutterType,
	ReferenceArray references
)
Public Function NewGutter (
	GutterType As GutterType,
	references As ReferenceArray
) As Gutter
public:
Gutter^ NewGutter(
	GutterType^ GutterType,
	ReferenceArray^ references
)
member NewGutter :
        GutterType : GutterType *
        references : ReferenceArray -> Gutter
Parameters
GutterType GutterType
 The type of the gutter to create
references ReferenceArray
 An array of planar lines and arcs that represents the place where you want to place the gutter.
Return Value
Gutter
 If successful a new gutter object within the project, otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown if the gutter type does not exist in the given document.
See Also
Reference
Document Class
NewGutter Overload
Autodesk.Revit.Creation Namespace